chat/tests/load_tests/socketio-chat-load-test.yaml
config:
  target: "http://localhost:8080"
  phases:
    - duration: 600
      arrivalRate: 5
    - duration: 600
      arrivalRate: 60
  variables:
    greeting: ["hello", "goedemorgen", "добрый день", "guten tag", "bonjour", "hola"]
  processor: "./functions.js"

scenarios:
  - name: "A user that just lurks"
    weight: 75
    engine: "socketio"
    flow:
      - get:
          url: "/"
      - emit:
          channel: "sendMessage"
          data: "lurker-{{$randomString()}}"
          namespace: "/chat"
      - think: 60

  - name: "A mostly quiet user"
    weight: 15
    engine: "socketio"
    flow:
      - get:
          url: "/"
      - emit:
          channel: "sendMessage"
          data: "quiet-{{ $randomString() }}"
          namespace: "/chat"
        response:
          channel: "sendMessageResponse"
          data: "world"
          namespace: "/chat"
      - think: 5
      - emit:
          channel: "new message"
          data: "{{ greeting }}"
          namespace: "/chat"
      - think: 60

  - name: "A chatty user"
    weight: 10
    engine: "socketio"
    flow:
      - get:
          url: "/"
      - emit:
          channel: "sendMessage"
          data: "chatty-{{ $randomString() }}"
          namespace: "/chat"
      - emit:
          channel: "sendMessage"
          data: "{{ greeting }}"
      - loop:
          - function: "setMessage"
          - emit:
              channel: "sendMessage"
              data: "{{ message }}"
              namespace: "/chat"
          - think: 10
        count: 10
      - think: 60